<?php

namespace App\Models;

use Illuminate\Database\Eloquent\Factories\HasFactory;
use Illuminate\Database\Eloquent\Model;


class Post extends Model
{
    use HasFactory;
    protected $fillable = [
        'datetime',
        'booth_id',
        'before_paper',
        'after_paper',
        'user_id',
    ];

    /**
     * この投稿を所有するユーザ。（ Userモデルとの関係を定義）
     */
    public function user()
    {
        return $this->belongsTo(User::class);
    }
    
    const BOOTHS = [
        0 => '7F女ブース1',
        1 => '7F女ブース2',
        2 => '7F男ブース1',
        3 => '6F南女ブース1',
        4 => '6F南女ブース2',
        5 => '6F南女ブース3',
        6 => '6F南女ブース4',
        7 => '6F南男ブース1',
        8 => '6F南男ブース2',
        9 => '6F南マルチ',
        10 => '6F北女ブース1',
        11 => '6F北女ブース2',
        12 => '6F北女ブース3',
        13 => '6F北女ブース4',
        14 => '6F北男ブース1',
        15 => '6F北男ブース2',
        16 => '5F南女ブース1',
        17 => '5F南女ブース2',
        18 => '5F南女ブース3',
        19 => '5F南女ブース4',
        20 => '5F南男ブース1',
        21 => '5F南男ブース2',
        22 => '5F北女ブース1',
        23 => '5F北女ブース2',
        24 => '5F北女ブース3',
        25 => '5F北男ブース1',
        26 => '4F南女ブース1',
        27 => '4F南女ブース2',
        28 => '4F南女ブース3',
        29 => '4F南女ブース4',
        30 => '4F南男ブース1',
        31 => '4F南男ブース2',
        32 => '4F南マルチ',
        33 => '4F北女ブース1',
        34 => '4F北女ブース2',
        35 => '4F北女ブース3',
        36 => '4F北男ブース1',
        37 => '3F女ブース1',
        38 => '3F女ブース2',
        39 => '3F女ブース3',
        40 => '3F女ブース4',
        41 => '3F男ブース1',
        42 => '3F男ブース2',
        43 => '3Fマルチ',
        44 => '2F女ブース1',
        45 => '2F女ブース2',
        46 => '2F女ブース3',
        47 => '2F女ブース4',
        48 => '2F男ブース1',
        49 => '2F男ブース2',
        50 => '2Fマルチ',
    ];
}
